/*百鸡问题，已知公鸡每只 5 元，母鸡每只 3 元，小鸡每 3 只 1 元。现在要用 100 
元买 100 只鸡，求公鸡，母鸡和小鸡各为多少？*/ 
#include<stdio.h>

int main(){
    //i代表公鸡数量，j代表母鸡数量，k代表小鸡数量
    for (int i = 0; i < 20; i++)
    {
        for (int j = 0; j < 34; j++)
        {
            //由于100是整数，所以小鸡的数量为三的倍数
            for (int k = 0; k < 300; k+=3)
            {
                if (((i+j+k)==100)&&((5*i+3*j+k/3)==100))
                {
                    printf("公鸡%d只，母鸡%d只，小鸡%d只\n",i,j,k);
                }
            }
        } 
    }
}